throw-away-rin/stm32-cube-project-sht30/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define ADC_VIN_Pin GPIO_PIN_0
#define ADC_VIN_GPIO_Port GPIOA
#define ADC_5V_Pin GPIO_PIN_1
#define ADC_5V_GPIO_Port GPIOA
#define ADC_CURRENT_Pin GPIO_PIN_3
#define ADC_CURRENT_GPIO_Port GPIOA
#define INT_RGB_LED_BLUE_Pin GPIO_PIN_4
#define INT_RGB_LED_BLUE_GPIO_Port GPIOA
#define ADC_VERSION_Pin GPIO_PIN_1
#define ADC_VERSION_GPIO_Port GPIOB
#define INT_RGB_LED_GREEN_Pin GPIO_PIN_8
#define INT_RGB_LED_GREEN_GPIO_Port GPIOA
#define INT_RGB_LED_RED_Pin GPIO_PIN_15
#define INT_RGB_LED_RED_GPIO_Port GPIOA
#define PWM3_TIM3_CH1_Pin GPIO_PIN_4
#define PWM3_TIM3_CH1_GPIO_Port GPIOB
#define PWM4_TIM3_CH2_Pin GPIO_PIN_5
#define PWM4_TIM3_CH2_GPIO_Port GPIOB
#define PWM2_TIM4_CH1_Pin GPIO_PIN_6
#define PWM2_TIM4_CH1_GPIO_Port GPIOB
#define PWM1_TIM4_CH2_Pin GPIO_PIN_7
#define PWM1_TIM4_CH2_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
